Kristian8606/airplay-esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# AirPlay receiver defaults
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ESP32-S3 N8R8 uses quad flash + octal PSRAM.
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_32B=y

# AirPlay RX/burst-priority WiFi/LwIP profile (Espressif performance-oriented).
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=24
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=6
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=32
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=n
CONFIG_MDNS_MAX_SERVICES=4
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y
CONFIG_MDNS_MEMORY_ALLOC_SPIRAM=y
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_RCVBUF=y
# Realtime streaming TCP/LwIP sizing.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_COLORS=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_HTTPD_WS_SUPPORT=y

# Keep I2S DMA EOF timing alive while flash cache is temporarily disabled.
CONFIG_I2S_ISR_IRAM_SAFE=y

# Amplifier power control
CONFIG_AIRPLAY_AMP_CONTROL=y
CONFIG_AIRPLAY_AMP_GPIO=21
CONFIG_AIRPLAY_AMP_ACTIVE_HIGH=y
CONFIG_AIRPLAY_AMP_OFF_DELAY_SEC=300

# Temporary AirPlay diagnostics - development build
CONFIG_AIRPLAY_DIAGNOSTICS=n
CONFIG_AIRPLAY_DIAG_TRANSPORT=n
CONFIG_AIRPLAY_DIAG_BUFFER=n
CONFIG_AIRPLAY_DIAG_FLUSH=n
CONFIG_AIRPLAY_DIAG_CODEC=n
CONFIG_AIRPLAY_DIAG_SYNC=n
CONFIG_AIRPLAY_DIAG_PLAYOUT=n
CONFIG_AIRPLAY_DIAG_LIFECYCLE=n
CONFIG_AIRPLAY_DIAG_HIGH_RATE_TRACE=n